### Terraform `plan` Succeeded for Workspace: `prd`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.vpc.aws_cloudwatch_log_group.flow_log[0] will be created
+   resource "aws_cloudwatch_log_group" "flow_log" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       name              = (known after apply)
+       name_prefix       = (known after apply)
+       retention_in_days = 0
+       skip_destroy      = false
+       tags              = {
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
+       tags_all          = {
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
    }

  # module.vpc.aws_default_network_acl.this[0] will be created
+   resource "aws_default_network_acl" "this" {
+       arn                    = (known after apply)
+       default_network_acl_id = (known after apply)
+       id                     = (known after apply)
+       owner_id               = (known after apply)
+       tags                   = {
+           "Name"        = "jingood2-prd-default-acl"
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
+       tags_all               = {
+           "Name"        = "jingood2-prd-default-acl"
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
+       vpc_id                 = (known after apply)

+       egress {
+           action          = "allow"
+           from_port       = 0
+           ipv6_cidr_block = "::/0"
+           protocol        = "-1"
+           rule_no         = 101
+           to_port         = 0
        }
+       egress {
+           action     = "allow"
+           cidr_block = "0.0.0.0/0"
+           from_port  = 0
+           protocol   = "-1"
+           rule_no    = 100
+           to_port    = 0
        }

+       ingress {
+           action          = "allow"
+           from_port       = 0
+           ipv6_cidr_block = "::/0"
+           protocol        = "-1"
+           rule_no         = 101
+           to_port         = 0
        }
+       ingress {
+           action     = "allow"
+           cidr_block = "0.0.0.0/0"
+           from_port  = 0
+           protocol   = "-1"
+           rule_no    = 100
+           to_port    = 0
        }
    }

  # module.vpc.aws_default_route_table.default[0] will be created
+   resource "aws_default_route_table" "default" {
+       arn                    = (known after apply)
+       default_route_table_id = (known after apply)
+       id                     = (known after apply)
+       owner_id               = (known after apply)
+       route                  = (known after apply)
+       tags                   = {
+           "Name"        = "jingood2-prd-default-rt"
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
+       tags_all               = {
+           "Name"        = "jingood2-prd-default-rt"
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
+       vpc_id                 = (known after apply)

+       timeouts {
+           create = "5m"
+           update = "5m"
        }
    }

  # module.vpc.aws_default_security_group.this[0] will be created
+   resource "aws_default_security_group" "this" {
+       arn                    = (known after apply)
+       description            = (known after apply)
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name"        = "jingood2-prd-default-sg"
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
+       tags_all               = {
+           "Name"        = "jingood2-prd-default-sg"
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
+       vpc_id                 = (known after apply)
    }

  # module.vpc.aws_eip.nat[0] will be created
+   resource "aws_eip" "nat" {
+       allocation_id        = (known after apply)
+       association_id       = (known after apply)
+       carrier_ip           = (known after apply)
+       customer_owned_ip    = (known after apply)
+       domain               = (known after apply)
+       id                   = (known after apply)
+       instance             = (known after apply)
+       network_border_group = (known after apply)
+       network_interface    = (known after apply)
+       private_dns          = (known after apply)
+       private_ip           = (known after apply)
+       public_dns           = (known after apply)
+       public_ip            = (known after apply)
+       public_ipv4_pool     = (known after apply)
+       tags                 = {
+           "Name"        = "jingood2-prd-vpc-us-east-1a"
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
+       tags_all             = {
+           "Name"        = "jingood2-prd-vpc-us-east-1a"
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
+       vpc                  = true
    }

  # module.vpc.aws_flow_log.this[0] will be created
+   resource "aws_flow_log" "this" {
+       arn                      = (known after apply)
+       iam_role_arn             = (known after apply)
+       id                       = (known after apply)
+       log_destination          = (known after apply)
+       log_destination_type     = "cloud-watch-logs"
+       log_format               = (known after apply)
+       log_group_name           = (known after apply)
+       max_aggregation_interval = 60
+       tags                     = {
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
+       tags_all                 = {
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
+       traffic_type             = "ALL"
+       vpc_id                   = (known after apply)
    }

  # module.vpc.aws_iam_policy.vpc_flow_log_cloudwatch[0] will be created
+   resource "aws_iam_policy" "vpc_flow_log_cloudwatch" {
+       arn         = (known after apply)
+       id          = (known after apply)
+       name        = (known after apply)
+       name_prefix = "vpc-flow-log-to-cloudwatch-"
+       path        = "/"
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "logs:PutLogEvents",
+                           "logs:DescribeLogStreams",
+                           "logs:DescribeLogGroups",
+                           "logs:CreateLogStream",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
+                       Sid      = "AWSVPCFlowLogsPushToCloudWatch"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id   = (known after apply)
+       tags        = {
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
+       tags_all    = {
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
    }

  # module.vpc.aws_iam_role.vpc_flow_log_cloudwatch[0] will be created
+   resource "aws_iam_role" "vpc_flow_log_cloudwatch" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "vpc-flow-logs.amazonaws.com"
                        }
+                       Sid       = "AWSVPCFlowLogsAssumeRole"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = "vpc-flow-log-role-"
+       path                  = "/"
+       tags                  = {
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
+       tags_all              = {
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # module.vpc.aws_iam_role_policy_attachment.vpc_flow_log_cloudwatch[0] will be created
+   resource "aws_iam_role_policy_attachment" "vpc_flow_log_cloudwatch" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = (known after apply)
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
+   resource "aws_internet_gateway" "this" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       owner_id = (known after apply)
+       tags     = {
+           "Name"        = "jingood2-prd-vpc"
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
+       tags_all = {
+           "Name"        = "jingood2-prd-vpc"
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
+       vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
+   resource "aws_nat_gateway" "this" {
+       allocation_id        = (known after apply)
+       connectivity_type    = "public"
+       id                   = (known after apply)
+       network_interface_id = (known after apply)
+       private_ip           = (known after apply)
+       public_ip            = (known after apply)
+       subnet_id            = (known after apply)
+       tags                 = {
+           "Name"        = "jingood2-prd-vpc-us-east-1a"
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
+       tags_all             = {
+           "Name"        = "jingood2-prd-vpc-us-east-1a"
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
+   resource "aws_route" "private_nat_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       nat_gateway_id         = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
+   resource "aws_route" "public_internet_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       gateway_id             = (known after apply)
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
+   resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Name"        = "jingood2-prd-vpc-private"
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
+       tags_all         = {
+           "Name"        = "jingood2-prd-vpc-private"
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
+       vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
+   resource "aws_route_table" "public" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Name"        = "jingood2-prd-vpc-public"
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
+       tags_all         = {
+           "Name"        = "jingood2-prd-vpc-public"
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
+       vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.database[0] will be created
+   resource "aws_route_table_association" "database" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.database[1] will be created
+   resource "aws_route_table_association" "database" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[3] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.database[0] will be created
+   resource "aws_subnet" "database" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "20.0.20.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"        = "prd-db-1a"
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
+       tags_all                                       = {
+           "Name"        = "prd-db-1a"
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.database[1] will be created
+   resource "aws_subnet" "database" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "20.0.21.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"        = "prd-db-1c"
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
+       tags_all                                       = {
+           "Name"        = "prd-db-1c"
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "20.0.10.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"        = "prd-pri-1a"
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
+       tags_all                                       = {
+           "Name"        = "prd-pri-1a"
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "20.0.11.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"        = "prd-pri-1c"
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
+       tags_all                                       = {
+           "Name"        = "prd-pri-1c"
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[2] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "100.64.20.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"        = "jingood2-prd-vpc-private-us-east-1a"
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
+       tags_all                                       = {
+           "Name"        = "jingood2-prd-vpc-private-us-east-1a"
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[3] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "100.64.21.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"        = "jingood2-prd-vpc-private-us-east-1c"
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
+       tags_all                                       = {
+           "Name"        = "jingood2-prd-vpc-private-us-east-1c"
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "20.0.0.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"        = "prd-pub-1a"
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
+       tags_all                                       = {
+           "Name"        = "prd-pub-1a"
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "20.0.1.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"        = "prd-pub-1c"
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
+       tags_all                                       = {
+           "Name"        = "prd-pub-1c"
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
+   resource "aws_vpc" "this" {
+       arn                                  = (known after apply)
+       cidr_block                           = "20.0.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_classiclink                   = (known after apply)
+       enable_classiclink_dns_support       = (known after apply)
+       enable_dns_hostnames                 = true
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       tags                                 = {
+           "Name"        = "jingood2-prd-vpc"
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
+       tags_all                             = {
+           "Name"        = "jingood2-prd-vpc"
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
    }

  # module.vpc.aws_vpc_dhcp_options.this[0] will be created
+   resource "aws_vpc_dhcp_options" "this" {
+       arn                  = (known after apply)
+       domain_name          = "service.jingood2.prd"
+       domain_name_servers  = [
+           "127.0.0.1",
+           "10.0.0.2",
        ]
+       id                   = (known after apply)
+       netbios_name_servers = []
+       ntp_servers          = []
+       owner_id             = (known after apply)
+       tags                 = {
+           "Name"        = "jingood2-prd-vpc"
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
+       tags_all             = {
+           "Name"        = "jingood2-prd-vpc"
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
    }

  # module.vpc.aws_vpc_dhcp_options_association.this[0] will be created
+   resource "aws_vpc_dhcp_options_association" "this" {
+       dhcp_options_id = (known after apply)
+       id              = (known after apply)
+       vpc_id          = (known after apply)
    }

  # module.vpc.aws_vpc_ipv4_cidr_block_association.this[0] will be created
+   resource "aws_vpc_ipv4_cidr_block_association" "this" {
+       cidr_block = "100.64.0.0/16"
+       id         = (known after apply)
+       vpc_id     = (known after apply)
    }

  # module.vpc.aws_vpn_gateway.this[0] will be created
+   resource "aws_vpn_gateway" "this" {
+       amazon_side_asn = "64512"
+       arn             = (known after apply)
+       id              = (known after apply)
+       tags            = {
+           "Name"        = "jingood2-prd-vpc"
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
+       tags_all        = {
+           "Name"        = "jingood2-prd-vpc"
+           "environment" = "prd"
+           "owners"      = "jingood2"
        }
+       vpc_id          = (known after apply)
    }

Plan: 36 to add, 0 to change, 0 to destroy.
```
</details>